export default {

    appid: '124f67024ef2006f181b69568e3cdb6c',

    apiUrl: 'https://api.openweathermap.org/data/2.5/weather',

    languages: {

        default: 'ru',

        all: ['RU', 'EN', 'AR', 'KZ', 'DE', 'US', 'UK'],

    },

    visibility: [
        {
            from: 9000,
            to: 10000,
            value: 'Отличная',
        },

        {
            from: 7000,
            to: 8999,
            value: 'Хорошая',
        },

        {
            from: 4000,
            to: 6999,
            value: 'Нормальная',
        },

        {
            from: 0,
            to: 3999,
            value: 'Плохая',
        },
    ],

    background: {

        'clear': ['ясно'],
        'partly_cloudy': ['облачно', 'небольшая облачность', 'переменная облачность', 'облачно с прояснениями'],
        'mainly_cloudy': ['пасмурно'],
        'rain': ['дождь', 'небольшой дождь', 'небольшой проливной дождь', 'гроза с сильным дождём'],
    },

    cities: {

        default: 'Пушкин',

        all: ['Пушкин', 'Санкт-Петербург', 'Москва', 'Новосибирск', 'Казань', 'Уфа', 'Ульяновск', 'Белгород', 'Чебоксары', 'Волгоград'],

    },

}